Repository: adslbarxatov/MakeDecision
Catalog: src/MakeDecision_*.resx
Languages: ru_ru

# AppExit
source: Exit application?
ru_ru: Выйти из программы?

# HelpMessage
source: This application illustrates a nonlinear hierarchy analysis method. The method allows comparing some objects based on a set of criteria and choosing the most “quality” object, i.e. the one with the highest rating. User is invited to independently select objects and criteria for their comparison, as well as evaluate the significance of each criterion and the "cost" of the object for each criterion. Each step of method is provided with explanations explaining the essence of method. If necessary, all steps can be repeated again. First version of application was created in Microsoft Visual Basic 6.0 development environment. This tool and, accordingly, the programming language 8 years ago were no longer the best development solutions. However, in this case, their capabilities were quite enough. In addition, their simplicity made it possible to complete the program as soon as possible. This implementation only transfers the solution to our common ecosystem for all other projects. During the development, only lecture material was used, the understanding of which is more than enough to create this (and similar) illustrative application
ru_ru: Программа иллюстрирует нелинейный метод анализа иерархий. Метод предполагает сравнение некоторых объектов на основе набора критериев и выбор наиболее «качественного» объекта, т.е. того, у которого итоговый коэффициент будет наивысшим. Пользователю предлагается самостоятельно выбрать объекты и критерии для их сравнения, а также оценить значимость каждого критерия и «стоимость» объекта по каждому критерию. Каждый шаг метода снабжён пояснениями, излагающими суть метода. При необходимости, все шаги можно повторить заново. Первая версия программы была выполнена в среде разработки Microsoft Visual Basic 6.0. Данная среда разработки и, соответственно, язык программирования 8 лет назад уже не являлись наилучшими средствами разработки. Однако в данном случае их возможностей было вполне достаточно. К тому же их простота позволила выполнить полную разработку программы в кратчайшие сроки. Данная же реализация лишь переносит решение в нашу общую для всех остальных проектов экосистему. При разработке использовался только лекционный материал, понимания которого более чем достаточно для создания данного (и ему подобных) иллюстративного приложения

# IncorrectValueError
source: Value must be an integer
ru_ru: Значение оценки должно быть целым числом

# MakeDecisionForm_BExit
source: E&xit
ru_ru: В&ыход

# MakeDecisionForm_BNext
source: &Next
ru_ru: &Далее

# MakeDecisionForm_BReset
source: &Reset
ru_ru: &Заново

# MakeDecisionForm_SkipUnnecessarySteps
source: Skip unnecessary steps
ru_ru: Пропускать необязательные шаги

# NotEnoughCriteria
source: Not enough criteria to compare
ru_ru: Недостаточно критериев для сравнения

# NotEnoughData
source: Not all cells are filled or one of them got zero value
ru_ru: Заполнены не все ячейки или одна из них имеет нулевое значение

# NotEnoughObjects
source: Not enough elements to compare
ru_ru: Недостаточно элементов для сравнения

# ResultLabel
source: It follows from them that the element “{0: S}” is the best by given criteria
ru_ru: Из них следует, что самым лучшим по заданным критериям является элемент «{0:S}»

# Tab01_Label01
source: This application illustrates the use of nonlinear hierarchy analysis method for decision making. Click “Next” to start the illustration
ru_ru: Данная программа иллюстрирует применение нелинейного метода анализа иерархий для принятия решений. Для начала иллюстрации нажмите «Далее»

# Tab02_Label02
source: The hierarchy analysis method allows you to compare objects, phenomena or scenarios based on a set of criteria and select the most “correct” one, that is, one for which the final coefficient will be the highest. Therefore, for starters, you must select the elements that you want to compare. To do this, simply enter their names in the list below
ru_ru: Метод анализа иерархий позволяет сравнить объекты, явления или варианты развития событий на основе набора критериев и выбрать наиболее «правильный», т.е. тот, у которого итоговый коэффициент будет наивысшим. Поэтому для начала необходимо выбрать элементы, которые необходимо сравнить. Для этого просто введите их названия в список ниже

# Tab03_Label03
source: Now you need to select the criteria for comparing previously specified elements in the same way, as well as indicate their “price” – the degree of significance, priority. It can be set "on a scale from 1 to 10" (to 100, to 1000), points, ratings – as you like. The main thing is that a HIGHER number determines a MORE SIGNIFICANT criterion
ru_ru: Теперь Вам необходимо таким же образом выбрать критерии для сравнения ранее указанных объектов, а также указать их «цену», т. е. степень значимости, приоритет. Её можно задать «по шкале от 1 до 10» (до 100, до 1000), баллами, оценками – как угодно. Главное – чтобы БОЛЬШЕЕ число определяло БОЛЕЕ ЗНАЧИМЫЙ критерий

# Tab04_Label04
source: At this step, the comparison matrix is restored from obtained vector of priorities. To do this, a simple duplication of the original vector is performed until the matrix becomes square. After this each column is divided by its own element, number of which is equal to number of column in the matrix. As a result, in matrix on the main diagonal, all elements become equal to 1
ru_ru: На этом шаге из полученного вектора приоритетов создаётся матрица сравнений. Для этого выполняется дублирование исходного вектора до тех пор, пока матрица не становится квадратной. После этого каждый столбец делится на тот свой элемент, номер которого равен номеру столбца в матрице. В результате в матрице на главной диагонали все элементы становятся равными 1

# Tab05_Label05
source: Similarly, elements evaluation vectors are set and processed according to each criterion. The only remark: HIGHER priority value should correspond to BETTER element, i.e. more suitable, compatible, cheaper, etc.
ru_ru: Аналогичным образом задаются и обрабатываются вектора оценок элементов по каждому критерию. Единственное замечание: БОЛЬШЕЕ значение приоритета должно соответствовать ЛУЧШЕМУ элементу, т.е. более подходящему, более качественному, более дешёвому и т.д.

# Tab06_Label06
source: Now everything is ready to obtain final estimates of elements. This is done as follows: • For all normalized matrices (both criteria and elements), harmonic vectors are compiled: each element of the vector is equal to product of elements of corresponding row of matrix raised to power inverse to number of elements in the row; • Then matrices are multiplied by these vectors; • Next, resulting price vectors of elements according to different criteria are merged into the matrix in the order in which these criteria were announced; • Finally, this matrix is ​​multiplied by the price vector of the criteria. Resulting vector will be the result of the method. The highest number in it will indicate the "best" element in given conditions
ru_ru: Итак, теперь всё готово для получения конечных оценок элементов. Делается это следующим образом: • Для всех нормализованных матриц (и критериев, и элементов) составляются вектора средних гармонических: каждый элемент вектора равен произведению элементов соответствующей строки матрицы, возведённому в степень, обратную количеству элементов в строке; • Затем матрицы умножаются на эти вектора; • Далее получившиеся вектора цен элементов по разным критериям склеиваются в матрицу в том порядке, в котором эти критерии были объявлены; • Наконец, эта матрица умножается на вектор цен критериев. Полученный вектор будет результатом метода. Самое большое число в нём укажет на «наилучший» элемент в заданных условиях

# Tab07_Label07
source: Results of hierarchy analysis method are as follows:
ru_ru: Результаты метода анализа иерархий таковы:

# TooManyCriteria
source: Too many criteria to compare
ru_ru: Слишком много критериев для сравнения

# TooManyObjects
source: Too many elements to compare
ru_ru: Слишком много элементов для сравнения
